package by.teachmeskills.hometask3;

public class FiveToOne {
    public static void main(String[] args) {
        /*Задача 2. Необходимо вывести на экран числа от 5 до 1.
          При решении используйте операцию декремента (--).
        */
        for(int i=5;i>=1;i--){
            System.out.println(i + "; ");
        }
    }
}
