package by.teachmeskills.hometask3;

public class SquareOf {
    public static void main(String[] args) {
        /*Задача 6. Составьте программу, выводящую на экран квадраты чисел от 10 до 20 включительно.
         */
        for (int i=10; i>=10&&i<=20; i++){
            System.out.print(Math.pow(i, 2) + "; ");
        }
    }
}
